//----------------------------------------------------------------------------------------------
// Ajax
//----------------------------------------------------------------------------------------------
const requester = 'account'
const command = 'change_password';

//----------------------------------------------------------------------------------------------
// Object
//----------------------------------------------------------------------------------------------
const PASSWORD_RULES = {
    rule1: /^(?=.*?[A-Z])(?=.*?[a-z])(?=.*?[0-9]).{8,15}$/, // 영문대소, 숫자
    rule2: /^(?=.*?[A-Z])(?=.*?[a-z])(?=.*?[#?!@$%^&*-]).{8,15}$/, //  영문대소, 특수문자
    rule3: /^(?=.*?[A-Z])(?=.*?[0-9])(?=.*?[#?!@$%^&*-]).{8,15}$/, // 영문대, 숫자, 특수문자
    rule4: /^(?=.*?[a-z])(?=.*?[0-9])(?=.*?[#?!@$%^&*-]).{8,15}$/, // 영문소, 숫자, 특수문자
};

//----------------------------------------------------------------------------------------------
// Variables & Const
//----------------------------------------------------------------------------------------------
const FIND_ACCOUNT_URL = 'login/authorization.html';
const EMPTY_VALUE = '';

//----------------------------------------------------------------------------------------------
// Input
//----------------------------------------------------------------------------------------------
const $oldPassword = $("#old-password");
const $newPassword = $("#new-password");
const $rePassword = $("#re-password");

//----------------------------------------------------------------------------------------------
// Validate
//----------------------------------------------------------------------------------------------
const VALIDATE_PASSWORD_NEW_VALUE_EMPTY = "새로운 비밀번호를 입력하세요.";
const VALIDATE_PASSWORD_CONFIRM_VALUE_EMPTY = "비밀번호 확인을 입력하세요.";
const VALIDATE_PASSWORD_BOTH_VALUE_SAME = "새로운 비밀번호와 확인이 일치하지 않습니다.";
const VALIDATE_PASSWORD_RULE_VALUE_VIOLATION = "패스워드는 영문 대소문자, 숫자, 특수문자를 <br> 3개 조합으로 8 ~ 15 자리여야 합니다.";
const VALIDATE_PASSWORD_RULE_VALUE_VIOLATION_LABEL = "패스워드는 영문 대소문자, 숫자, 특수문자를 3개 조합으로 8 ~ 15 자리여야 합니다.";
const VALIDATE_PASSWORD_OLD_VALUE_SAME = "기존 패스워드와 동일 합니다 .<br> 다른 비밀번호를 사용하세요.";
const VALIDATE_AUTH_TIME_OVER = "인증번호 시간이 초과 하였습니다. <br> 재요청바랍니다.";
const VALIDATE_PASSWORD_CURRENT_VALUE_SAME = "현재 비밀번호가 다릅니다. 다시 입력해주세요.";

//----------------------------------------------------------------------------------------------
// Message
//----------------------------------------------------------------------------------------------
const PASSWORD_CHANGE_SUCCESS_MESSAGE = '비밀번호가 변경되었습니다. 로그인 해 주세요.';

//----------------------------------------------------------------------------------------------
// Color
//----------------------------------------------------------------------------------------------
const PASSWORD_CHANGE_DISABLED = '#999999';
const PASSWORD_CHANGE_ENABLED = '#578fac';

//----------------------------------------------------------------------------------------------
// Label
//----------------------------------------------------------------------------------------------
const $labelPasswordError= $("#label_password_error");
const $labelValidPasswordMsg = $("#label_valid_password_msg");
const $labelValidPasswordConfirmMsg = $("#label_valid_password_confirm_msg");

//----------------------------------------------------------------------------------------------
// Button
//----------------------------------------------------------------------------------------------
const $btnPasswordChange = $("#btn_password_change");
const $btnPasswordReset = $("#btn_password_reset");
const $btnPopupConfirm = $("#btn_popup_confirm");

//----------------------------------------------------------------------------------------------
// Popup
//----------------------------------------------------------------------------------------------
const $formPopupChangePassword = $(".form_popup_change_password");
let changePasswordParams = {
    beforeCallback: null,
    openCallback: null,
    closeCallback: null,
    $link: $formPopupChangePassword,
};
let changePasswordPopup = module.popup(changePasswordParams);