//---------------------------------------------------------------------------------------------------
// Ajax
//---------------------------------------------------------------------------------------------------
const requester = 'facility';
const command = 'facility'

//---------------------------------------------------------------------------------------------------
// array
//---------------------------------------------------------------------------------------------------
const $periodName = ['금년', '금월', '금일'];
const $periodKeyName = ['year', 'month', 'daily'];
const GRAPH_DATA = CONFIGS['facility']['graph_data'];
const CHART_LABELS = CONFIGS['facility']['graph_labels'];
const CHART_COLORS = CONFIGS['facility']['graph_colors'];
const USAGE_LABELS = [];
//const TABLE_TH_TITLES = ['사용량', '역률'];

//---------------------------------------------------------------------------------------------------
// Variables & Const
//---------------------------------------------------------------------------------------------------
const DEFAULT_PERIOD_STATUS = 2; // 기간은 디폴트가 '일'
const IS_AUTO_SEARCH = CONFIGS['facility']['is_auto_search'];
//const RESULT_POWER_FACTOR = CONFIGS['power_factor'];
let DEFAULT_UNIT = 'kWh';

//----------------------------------------------------------------------------------------------
// table
//----------------------------------------------------------------------------------------------
const $tbodyFacility = $("#tbody_facility");

//---------------------------------------------------------------------------------------------------
// Buttons
//---------------------------------------------------------------------------------------------------
const $btnSearch = $("#btn_search");

//---------------------------------------------------------------------------------------------------
// selectbox
//---------------------------------------------------------------------------------------------------
const $periodType = $(".period_type");

//---------------------------------------------------------------------------------------------------
// Input
//---------------------------------------------------------------------------------------------------
const $dateSelect = $("#date_select");

//----------------------------------------------------------------------------------------------
// Div
//----------------------------------------------------------------------------------------------
const $divChartLegendStatus = $("#div_chart_legend_status");

//---------------------------------------------------------------------------------------------------
// Chart
//---------------------------------------------------------------------------------------------------
const IS_USE_CHART_TOOLTIP = true;

const DEFAULT_ITEM_COUNT = 30;
const DEFAULT_ARRAY = Array.from({length:DEFAULT_ITEM_COUNT}, () => '');

const canvasChartMiddleId = 'canvas_chart_middle';

let chartEfficiency = createFacilityChart(canvasChartMiddleId, IS_USE_CHART_TOOLTIP);
chartEfficiency.update(DEFAULT_ARRAY, DEFAULT_ARRAY, DEFAULT_ARRAY, CHART_LABELS, CHART_COLORS);